{
    "K": {
        "PS": {
            "2": {
                "1": "计划并进行调查，以比较不同力度或不同方向的推拉对物体运动的影响。[说明：推拉的例子可以包括拉动物体的绳子、推动物体的人、阻止滚动球的人，以及两个物体碰撞时的推拉。] [评估范围：评估仅限于不同的相对力度或不同的方向，但不同时包括两者。评估不包括非接触式的推拉，如磁铁产生的推拉。]",
                "2": "分析数据以确定设计方案是否如预期般通过推或拉来改变物体的速度或方向。* [说明：需要解决的问题的例子可以包括使弹珠或其他物体移动一定距离、沿特定路径移动并击倒其他物体。解决方案的例子可以包括使用坡道来增加物体速度和使物体如弹珠或球转向的结构。] [评估范围：评估不包括摩擦作为改变速度的机制。]"
            },
            "3": {
                "1": "观察以确定阳光对地球表面的影响。[说明：地球表面的例子可以包括沙子、土壤、岩石和水。] [评估范围：温度的评估仅限于相对测量，如更暖/更凉。]",
                "2": "使用工具和材料设计并建造一个结构，以减少阳光对某一区域的暖化效果。* [说明：结构的例子可以包括遮阳伞、遮阳篷和帐篷，以减少阳光的暖化效果。]"
            }
        },
        "LS": {
            "1": {
                "1": "通过观察描述植物和动物（包括人类）生存所需的模式。[说明：模式的例子可以包括动物需要摄入食物而植物不需要；不同种类的动物需要不同种类的食物；植物需要光；所有生物都需要水。]"
            }
        },
        "ESS": {
            "2": {
                "1": "使用并分享当地天气状况的观察以描述随时间变化的模式。[说明：定性观察的例子可以包括对天气的描述（如晴天、多云、雨天和温暖）；定量观察的例子可以包括一个月内晴天、风天和雨天的数量。模式的例子可以包括早上通常比下午凉爽，不同月份晴天和多云天的数量。] [评估范围：定量观察的评估仅限于整数和相对测量，如更暖/更凉。]",
                "2": "基于证据构建论据，说明植物和动物（包括人类）如何改变环境以满足他们的需求。[说明：植物和动物改变环境的例子可以包括松鼠在地下挖洞藏食物和树根能破坏混凝土。]"
            },
            "3": {
                "1": "使用模型表示不同植物或动物（包括人类）的需求与它们居住地之间的关系。[说明：关系的例子可以包括鹿吃芽和叶子，因此它们通常生活在森林地区；草需要阳光，所以它们经常生长在草地上。植物、动物及其周围环境构成一个系统。]",
                "2": "提出问题以获取有关天气预报的目的和准备应对恶劣天气的信息。* [说明：强调本地形式的恶劣天气。]",
                "3": "交流能够减少人类对当地环境中的土地、水、空气和/或其他生物影响的解决方案。* [说明：人类对土地的影响的例子可以包括砍树造纸和使用资源制造瓶子。解决方案的例子可以包括重复使用纸张和回收罐子和瓶子。]"
            }
        }
    },
    "1": {
        "PS": {
            "4": {
                "1": "计划并进行调查以提供证据，证明振动的材料可以产生声音，声音可以使材料振动。[说明：产生声音的振动材料的例子可以包括音叉和拨动拉伸的弦。声音如何使物质振动的例子可以包括在发声的扬声器附近放一张纸和在振动的音叉附近放一个物体。]",
                "2": "通过观察构建一个基于证据的叙述，说明物体只有在被照亮时才能被看见。[说明：观察的例子可以包括在完全黑暗的房间中、针孔箱中和手电筒照亮的洞穴探险视频中进行的观察。照明可以来自外部光源或物体自身发光。]",
                "3": "计划并进行调查，以确定将不同材料制成的物体放在光束路径中产生的效果。[说明：材料的例子可以包括透明材料（如透明塑料）、半透明材料（如蜡纸）、不透明材料（如纸板）和反射材料（如镜子）。] [评估范围：评估不包括光速。]",
                "4": "使用工具和材料设计并建造一个使用光或声音来解决远距离通信问题的设备。* [说明：设备的例子可以包括用光源发送信号、纸杯和绳子电话以及鼓声模式。] [评估范围：评估不包括通信设备如何工作的技术细节。]"
            }
        },
        "LS": {
            "1": {
                "1": "使用材料设计一个通过模仿植物和/或动物的外部部位来解决人类问题的方案，以帮助它们生存、成长和满足需求。* [说明：通过模仿植物或动物解决方案来解决人类问题的例子可以包括模仿龟壳、橡子壳和动物鳞片设计衣物或设备以保护骑车者；模仿动物尾巴和植物根部稳定结构；模仿树枝上的刺和动物的刺防止入侵者；以及模仿眼睛和耳朵探测入侵者。]",
                "2": "阅读文本并使用媒体来确定帮助后代生存的父母和后代行为的模式。[说明：行为模式的例子可以包括后代发出的信号（如哭泣、啁啾和其他叫声）以及父母的反应（如喂食、安慰和保护后代）。]"
            },
            "3": {
                "1": "通过观察构建一个基于证据的叙述，说明幼小的植物和动物与它们的父母相似，但并不完全相同。[说明：模式的例子可以包括植物或动物共享的特征。观察的例子可以包括同一种植物的叶子形状相同但大小不同；以及一种狗的品种看起来像它的父母但不完全相同。] [评估范围：评估不包括遗传或经历变态发育或杂交的动物。]"
            }
        },
        "ESS": {
            "1": {
                "1": "通过观察太阳、月亮和星星描述可预测的模式。[说明：模式的例子可以包括太阳和月亮在天空中的出现位置、移动轨迹和落下位置；太阳以外的星星在夜晚可见但在白天不可见。] [评估范围：星星模式的评估仅限于星星在夜晚可见而在白天不可见。]",
                "2": "在一年中的不同时间进行观察，以将白昼时间与季节联系起来。[说明：强调冬季和春季或秋季白昼时间的相对比较。] [评估范围：评估仅限于白昼时间的相对量，而不是量化白昼时间或时长。]"
            }
        }
    },
    "2": {
        "PS": {
            "1": {
                "1": "计划并进行调查，以描述和分类不同种类材料的可观察性质。[说明：观察可以包括颜色、质地、硬度和柔韧性。模式可以包括不同材料共享的相似性质。]",
                "2": "分析从测试不同材料中获得的数据，以确定哪些材料的性质最适合预期用途。* [说明：性质的例子可以包括强度、柔韧性、硬度、质地和吸水性。] [评估范围：定量测量的评估仅限于长度。]",
                "3": "通过观察构建一个基于证据的叙述，说明由一小组零件制成的物体可以拆解并制成新物体。[说明：零件的例子可以包括积木、建筑砖或其他各种小物体。]",
                "4": "用证据构建论据，说明一些由加热或冷却引起的变化是可逆的，而一些是不可逆的。[说明：可逆变化的例子可以包括在不同温度下的水和黄油。不可逆变化的例子可以包括煮鸡蛋、冷冻植物叶片和加热纸张。]"
            }
        },
        "LS": {
            "2": {
                "1": "计划并进行调查，以确定植物是否需要阳光和水才能生长。[评估范围：评估仅限于一次测试一个变量。]",
                "2": "开发一个简单模型来模仿动物在传播种子或授粉植物中的作用。*"
            },
            "4": {
                "1": "通过观察植物和动物来比较不同栖息地的生物多样性。[说明：强调每种不同栖息地中生物的多样性。] [评估范围：评估不包括具体栖息地中的具体动植物名称。]"
            }
        },
        "ESS": {
            "1": {
                "1": "利用来自多个来源的信息提供证据，说明地球事件可以迅速或缓慢发生。[说明：事件和时间尺度的例子可以包括迅速发生的火山爆发和地震，以及缓慢发生的岩石侵蚀。] [评估范围：评估不包括时间尺度的定量测量。]"},
            "2": {
                "1": "比较多种设计来减缓或防止风或水改变地形的解决方案。* [说明：解决方案的例子可以包括不同设计的堤坝和防风林来阻挡风和水，以及使用灌木、草和树木来稳固地形的不同设计。]",
                "2": "开发一个模型来表示某一地区的地形和水体的形状和种类。[评估范围：评估不包括模型中的定量缩放。]",
                "3": "获取信息以识别地球上的水的分布位置及其可以是固态或液态。"
            }
        }
    },
    "K2": {
        "ETS": {
            "1": {
                "1": "提出问题，进行观察，并收集有关人们想要改变的情况的信息，以定义一个可以通过开发新物品或工具来解决的简单问题。",
                "2": "开发一个简单的草图、绘图或物理模型，以说明物体的形状如何帮助其按需发挥功能，以解决特定问题。",
                "3": "分析两个为解决同一问题而设计的物体的测试数据，以比较它们各自表现的优缺点。"
            }
        }
    }
}